Revit 2027 API
PanelScheduleView.CreateInstanceView(Document, ElementId, ElementId) Method
 Creates a new instance of this view (using specific template)
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static PanelScheduleView CreateInstanceView(
	Document ADoc,
	ElementId templateId,
	ElementId panelId
)
Public Shared Function CreateInstanceView (
	ADoc As Document,
	templateId As ElementId,
	panelId As ElementId
) As PanelScheduleView
public:
static PanelScheduleView^ CreateInstanceView(
	Document^ ADoc,
	ElementId^ templateId,
	ElementId^ panelId
)
static member CreateInstanceView :
        ADoc : Document *
        templateId : ElementId *
        panelId : ElementId -> PanelScheduleView
Parameters
ADoc Document
 The Document
templateId ElementId
 The templateId that this function will use
panelId ElementId
 Element id of the electrical panel element.
Return Value
PanelScheduleView
 The PanelScheduleView
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PanelScheduleView Class
CreateInstanceView Overload
Autodesk.Revit.DB.Electrical Namespace